{
  "recipes": [
    {
      "id": 1,
      "title": "Spaghetti Carbonara",
      "summary": "A classic Italian pasta dish made with eggs, cheese, pancetta, and pepper.",
      "image": "https://t4.ftcdn.net/jpg/01/41/12/25/360_F_141122511_X1eEXS9nH13p6TziRMEmAvPmQVCYbyWy.jpg",
      "instructions": [
        "Boil water: Bring a large pot of salted water to a boil.",
        "Cook pasta: Add spaghetti and cook until al dente, about 8-10 minutes.",
        "Prepare sauce: In a bowl, whisk together eggs and grated Parmesan cheese.",
        "Cook pancetta: In a large skillet, cook pancetta over medium heat until crispy.",
        "Combine: Drain pasta and add it to the skillet with pancetta. Remove from heat and quickly stir in the egg mixture. Toss well to combine.",
        "Serve: Season with black pepper and serve immediately."
      ]
    },
    {
      "id": 2,
      "title": "Chicken Stir-Fry",
      "summary": "A quick and easy Asian-inspired dish with chicken and vegetables.",
      "image": "https://img.freepik.com/free-photo/chicken-stir-fry-vegetables_123827-21543.jpg",
      "instructions": [
        "Heat oil: Heat vegetable oil in a large pan over medium-high heat.",
        "Cook chicken: Add sliced chicken breasts and cook until browned, about 5-7 minutes.",
        "Add vegetables: Add mixed vegetables (bell peppers, broccoli, snap peas) and stir-fry for another 5 minutes.",
        "Make sauce: In a small bowl, mix soy sauce, garlic, ginger, and cornstarch. Pour into the pan and cook until the sauce thickens.",
        "Serve: Serve over rice or noodles."
      ]
    },
    {
      "id": 3,
      "title": "Cheesy Gnocchi",
      "summary": "Quick and easy cheesy bites with gnocchi, perfect for a comforting meal.",
      "image": "https://assets.bonappetit.com/photos/57b08b251b33404414976306/16:9/w_1280,c_limit/sweet-potato-gnocchi-with-brown-butter-and-sage.jpg",
      "instructions": [
        "Boil water: Bring a large pot of salted water to a boil.",
        "Cook gnocchi: Add gnocchi and cook until they float to the surface, about 3 minutes.",
        "Prepare sauce: In a large skillet, melt butter and add minced garlic. Cook until fragrant.",
        "Add gnocchi: Drain gnocchi and add to the skillet. Toss to coat.",
        "Add cheese: Sprinkle with grated cheese (Parmesan or mozzarella) and stir until melted.",
        "Serve: Garnish with fresh basil and serve immediately."
      ]
    },
    {
      "id": 4,
      "title": "Lemon Salmon",
      "summary": "Zesty, tender, savory, fresh, delightful.",
      "image": "https://paleogrubs.com/wp-content/uploads/2018/02/5-salmon-recipe-1200x675.jpg",
      "instructions": [
        "Preheat Oven: Preheat your oven to 375°F (190°C).",
        "Prepare the Marinade: In a small bowl, combine the juice of one lemon, minced garlic, olive oil, chopped dill, salt, and pepper.",
        "Marinate the Salmon: Place the salmon fillets in a baking dish and pour the marinade over them, ensuring each fillet is well-coated. Let them marinate for about 15 minutes to absorb the flavors.",
        "Bake the Salmon: Arrange lemon slices on top of the salmon fillets. Bake in the preheated oven for 15-20 minutes, or until the salmon is cooked through and flakes easily with a fork.",
        "Serve: Remove from the oven and let it rest for a few minutes. Serve the lemon salmon with your choice of side dishes, such as steamed vegetables, rice, or a fresh salad."
      ]
    },
    {
      "id": 5,
      "title": "Garlic Butter Shrimp",
      "summary": "Rich, buttery, garlicky, succulent, quick.",
      "image": "https://www.thespruceeats.com/thmb/5WJlMMrKjusLO7Zxl7cZC3idyuE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/grilled-garlic-butter-shrimp-335998-1e6d7821c388481c916e1492e1355ac9.jpg",
      "instructions": [
        "Prepare Ingredients: Mince the garlic, chop the parsley, and zest one lemon.",
        "Cook Shrimp: In a large skillet, melt butter over medium heat. Add the minced garlic and cook until fragrant, about 1 minute. Add the shrimp, salt, and pepper.",
        "Add Lemon: Cook shrimp for 2-3 minutes on each side, or until pink and opaque. Squeeze lemon juice over the shrimp and sprinkle with lemon zest.",
        "Finish with Parsley: Remove from heat and sprinkle chopped parsley over the shrimp.",
        "Serve: Serve immediately with a side of crusty bread or over pasta."
      ]
    },
    {
      "id": 6,
      "title": "Caprese Salad",
      "summary": "Fresh, simple, classic, Italian, vibrant.",
      "image": "https://i2.wp.com/www.downshiftology.com/wp-content/uploads/2019/07/Caprese-Salad-main-1.jpg",
      "instructions": [
        "Prepare Ingredients: Slice the tomatoes and mozzarella into thick slices.",
        "Assemble Salad: On a serving platter, alternate slices of tomato and mozzarella. Tuck fresh basil leaves in between the slices.",
        "Season: Drizzle with olive oil and balsamic glaze. Sprinkle with salt and pepper to taste.",
        "Serve: Serve immediately as a starter or side dish."
      ]
    }
  ]
}
